from decimal import Decimal

answers = [
    (('张皓', '经济学', 92), ('张皓', '古代汉语', 91), ('张航', '经济学', 94)),
    (('王娜', '计算机'), ('李倩', '计算机'), ('张皓', '计算机'), ('李静', '机电'), ('周小米', '机电'), ('王石', '管理'), ('谢楠', '管理'), ('蒋明', '管理'),
     ('陈冲', '管理'), ('赵琳', '管理'), ('韩寒', '材料'), ('吴亮', '材料'), ('刘波', '材料'), ('张斌', '文法'), ('周通', '文法'), ('张航', '计算机')),
    (('T01', '王娜'), ('T02', '李倩'), ('T04', '李静'), ('T05', '周小米'), ('T06', '王石'), ('T07', '谢楠'), ('T08', '蒋明'),
     ('T10', '赵琳'), ('T11', '韩寒'), ('T12', '吴亮'), ('T13', '刘波'), ('T14', '张斌'), ('T15', '周通')),
    (('T01',), ('T02',), ('T03',), ('T04',), ('T05',), ('T06',), ('T07',), ('T08',), ('T09',), ('T10',), ('T15',),
     ('T16',)),
    (('王娜', 54), ('陈冲', 45), ('赵琳', 46)),
    (('T01',), ('T02',), ('T03',), ('T04',), ('T08',), ('T15',), ('T16',)),
    (('王娜', '计算机'), ('李倩', '计算机'), ('张皓', '计算机'), ('周小米', '机电'), ('谢楠', '管理'), ('赵琳', '管理'), ('张航', '计算机')),
    (('C1', '数据库'), ('C2', '软件工程'), ('C4', '古代汉语'), ('C6', '材料力学'), ('C7', '通信原理')),
    (('C7',),),
    (),
    (('计算机', Decimal('78.5000')), ('材料', Decimal('76.0000')), ('机电', Decimal('73.5000')), ('文法', Decimal('66.5000')),
     ('管理', Decimal('58.0000'))),
    (('张航', '计算机', 94), ('张皓', '计算机', 92), ('李倩', '计算机', 74), ('王娜', '计算机', 54), ('谢楠', '管理', 69), ('王石', '管理', 66),
     ('蒋明', '管理', 64), ('赵琳', '管理', 46), ('陈冲', '管理', 45), ('吴亮', '材料', 86), ('韩寒', '材料', 75), ('刘波', '材料', 67),
     ('周小米', '机电', 83), ('李静', '机电', 64), ('周通', '文法', 68), ('张斌', '文法', 65)),
    (('C1', '数据库', '李梦'), ('C2', '软件工程', '张亮'), ('C3', '经济学', '王刚')),
    (('张航',),),
    (('C3', '经济学'), ('C4', '古代汉语'), ('C5', '信号与系统'))
]


def get_answers():
    return answers
